/*
 ============================================================================
 
 Author      : Ztiany
 Description : C++函数：decltype和尾置返回类型声明

 ============================================================================
 */

//1：使用decltype声明函数
static int odd[] = {1, 3, 5, 7, 9};
static int even[] = {0, 2, 4, 6, 8};

//decltype不负责把数组类型转换为对象的指针，所以返回值上需要加上*
decltype(even) *arrPtr(int i) {//返回一个指针，指针指向5个元素的数组
    return (i % 2) == 0 ? &even : &odd;
}


//2：c++11尾置返回类型声明
static auto func(int i) -> int (*)[10];//该函数返回一个指针，指针指向含有十个元素的int数组


